# Повідомлення для користувача

from sre_parse import State


MESSAGES = {
    "bot_error": "⚠️ 😕 Ой, щось пішло не так.\n"
    "🔄 Спробуйте ще раз пізніше або натисніть /start, щоб почати спочатку.\n"
    "Якщо проблема не зникне — зверніться до адміністратора @ulianahurska.",
    
    "invalid_ml_model": "Помилка: ML-модель не завантажена. Зверніться до адміністратора @ulianahurska.", 
    
    "welcome_text": (
        "👋 Вітаю в Боті-Оцінювачі Кредитного Ризику!\n"
        "Я проаналізую вашу заявку на позику та дам прогноз ризику дефолту.\n\n"
        "Давайте розпочнемо. Введіть, будь ласка, ваш <b>вік</b> (ціле число):"
    ),
    
    "age_negative": "Вік не може бути від'ємним. Будь ласка, введіть <b>реалістичний вік</b> (18-100).",
    "age_too_young": (
        "‼️ <b>ВІДМОВА</b> ‼️\n"
        "Ваша заявка не може бути оброблена через неповнолітній вік (менше 18 років).\n\n"
        "Щоб почати знову, натисніть /start."
    ),
    "age_too_high": "Будь ласка, введіть <b>реалістичний вік</b> (18-100).",
    "invalid_age": "Некоректний формат. Будь ласка, введіть вік <b>цілим числом</b>.",
    
    "gender_prompt": "Оберіть вашу стать:",
    "gender_invalid": "Оберіть <b>Чоловік</b> або <b>Жінка</b>, будь ласка.",

    "car_prompt": "Чи маєте ви <b>автомобіль</b>? (Так/Ні)",
    "car_invalid": "Будь ласка, виберіть <b>Так</b> або <b>Ні</b>.",
    
    "realty_prompt": "Чи маєте ви <b>нерухомість</b>? (Так/Ні)",
    "realty_invalid": "Будь ласка, виберіть <b>Так</b> або <b>Ні</b>.",
    
    "buttons_massage": "Будь ласка, оберіть зі списку кнопок нижче.",
    
    "income_prompt": "Введіть ваш <b>річний дохід</b> (ціле число, наприклад, 150000):",
    "income_zero": "Річний дохід не може бути нульовим. Будь ласка, введіть <b>коректний дохід</b>.",
    "income_minus": "Річний дохід не може бути від'ємним. Будь ласка, введіть <b>коректний дохід</b>.",
    "income_invalid": "Некоректний формат. Будь ласка, введіть <b>річний дохід цілим числом</b>.",
    "income_type_prompt": "Оберіть ваш <b>тип доходу</b>:",
    
    "education_prompt": "Оберіть ваш <b>рівень освіти</b>:",
    
    "marital_prompt": "Оберіть ваш <b>сімейний стан</b>:",
    
    "housing_prompt": "Оберіть <b>тип вашого житла</b>:",
    
    "children_prompt": "Введіть <b>кількість дітей</b> (ціле число):",
    "children_number": "Кількість дітей має бути в діапазоні <b>0-20</b>. Будь ласка, введіть коректне число.",
    "children_invalid": "Некоректний формат. Введіть <b>ціле число</b> для кількості дітей.",
    
    "occupation_prompt": "Оберіть вашу <b>професію</b>:",

    "family_members_prompt": "Введіть <b>кількість членів сім'ї</b> (ціле число). Якщо інших членів сім'ї окрім Вас <b>немає</b> - <b>введіть 1</b>",
    "family_members_number": "Кількість членів сім'ї має бути в діапазоні <b>1-20</b>. Будь ласка, введіть коректне число.",
    "family_members_invalid": "Некоректний формат. Введіть <b>ціле число</b> для кількості членів сім'ї. Якщо інших членів сім'ї окрім Вас <b>немає</b> - <b>введіть 1</b>",
    
    "employed_years_prompt": "Введіть ваш <b>стаж роботи у роках</b> (ціле число). Якщо не працюєте, введіть 0",
    "employed_years_negative": "Стаж роботи не може бути від'ємним. Будь ласка, введіть <b>коректний стаж</b> (0 або більше).",
    "employed_years_too_high": "Стаж роботи не може перевищувати <b>80 років</b>. Будь ласка, введіть <b>коректний стаж</b>.",
    "employed_years_invalid": "Некоректний формат. Введіть <b>ціле число</b> для стажу роботи. Якщо не працюєте, введіть 0",
    "employed_years_exceed_age": "Стаж роботи не може перевищувати ваш вік мінус 18 років.\nМаксимально можливий стаж: <b>{max_possible_experience}</b> років.\nБудь ласка, введіть <b>коректний стаж</b> (0 або більше).",
    
    
    "start_over": "Діалог завершено. Надішліть /start, щоб розпочати знову."

    
}

MAPPINGS = {
    "gender": {
        "Чоловік": "M",
        "Жінка": "F"
    },
    "car": {
        "Так": "Y",
        "Ні": "N"
    },
    "realty": {
        "Так": "Y",
        "Ні": "N"
    },
    "income_type": {
        'Працюю': 'Working',
        'Підприємець': 'Commercial associate',
        'Пенсіонер': 'Pensioner',
        'Державний службовець': 'State servant',
        'Студент': 'Student'
    },
    "education": {
        'Повна середня освіта': 'Secondary / secondary special',
        'Базова середня освіта': 'Lower secondary', 
        'Неповна вища освіта': 'Incomplete higher',        
        'Бакалавр / спеціаліст / магістр': 'Higher education',                                              
        'Науковий ступінь': 'Academic degree'                         
    },
    "family_status": {
        'Неодружений / Незаміжня': 'Single / not married',
        'Одружений / Заміжня': 'Married',
        'Цивільний шлюб': 'Civil marriage',
        'Розлучений / Розлучена': 'Separated',
        'Вдівець / Вдова': 'Widow'
    },
    "housing": {
        'Будинок / квартира': 'House / apartment',
        'Орендована квартира': 'Rented apartment',
        'Муніципальна квартира': 'Municipal apartment',
        'Кооперативна квартира': 'Co-op apartment',
        'Службова квартира': 'Office apartment',
        'З батьками': 'With parents'
    },
  "occupation": {
        'Робітник': 'Laborers',
        'Основний персонал': 'Core staff',
        'Продавець': 'Sales staff',
        'Менеджер': 'Managers',
        'Водій': 'Drivers',
        'Кваліфікований технічний працівник': 'High skill tech staff',
        'Медичний працівник': 'Medicine staff',
        'Бухгалтер': 'Accountants',
        'Охоронець': 'Security staff',
        'Офіціант / бармен': 'Waiters/barmen staff',
        'Некваліфікований працівник': 'Low-skill Laborers',
        'Прибиральник': 'Cleaning staff',
        'Працівник приватних послуг': 'Private service staff',
        'Без роботи': 'Missing'
    }

}


# Клавіатури
REPLY_KEYBOARDS = {
    "CODE_GENDER": [["Чоловік", "Жінка"]],
    "FLAG_OWN_CAR": [["Так", "Ні"]],
    "FLAG_OWN_REALTY": [["Так", "Ні"]],
    'NAME_INCOME_TYPE': [['Працюю', 'Підприємець', 'Пенсіонер'], ['Державний службовець', 'Студент']],
    'NAME_EDUCATION_TYPE': [
        ['Середня / спеціальна середня', 'Вища освіта'],
        ['Неповна вища', 'Нижча середня', 'Академічний ступінь']
    ],
    'NAME_FAMILY_STATUS': [
        ['Одружений / Заміжня', 'Неодружений / Незаміжня', 'Цивільний шлюб'],
        ['Розлучений / Розлучена', 'Вдівець / Вдова']
    ],
    'NAME_HOUSING_TYPE': [
        ['Будинок / квартира', 'Орендована квартира', 'Муніципальна квартира'],
        ['Кооперативна квартира', 'Службова квартира', 'З батьками']
    ],
    'OCCUPATION_TYPE': [
        ['Робітник', 'Основний персонал', 'Продавець', 'Менеджер'],
        ['Водій', 'Кваліфікований технічний працівник', 'Медичний працівник', 'Бухгалтер'],
        ['Охоронець', 'Офіціант / бармен', 'Некваліфікований працівник', 'Прибиральник', 'Працівник приватних послуг', 'Без роботи']
    ]

}

